Repository: Mahmoud-M-Hamed/bevlioon
Catalog: lib/core/l10n/app_*.arb
Languages: ar

# error_title_unauthorized
source: Unauthorized
ar: غير مصرح

# error_title_forbidden
source: Forbidden
ar: محظور

# error_title_not_found
source: Not Found
ar: غير موجود

# error_title_timeout
source: Request Timeout
ar: انتهت مهلة الطلب

# error_title_server_error
source: Server Error
ar: خطأ في الخادم

# error_title_network
source: Network Error
ar: خطأ في الشبكة

# error_title_invalid_response_format
source: Invalid Response Format
ar: صيغة استجابة غير صالحة

# error_title_unknown
source: Unknown Error
ar: خطأ غير معروف

# error_message_unauthorized
source: You are not authorized to perform this action.
ar: لست مخولًا لإجراء هذه العملية.

# error_message_forbidden
source: You do not have permission to access this resource.
ar: ليس لديك صلاحية للوصول إلى هذا المورد.

# error_message_not_found
source: The requested resource could not be found.
ar: المورد المطلوب غير موجود.

# error_message_timeout
source: The request took too long. Please try again.
ar: استغرق الطلب وقتًا طويلًا. يرجى المحاولة مرة أخرى.

# error_message_server_error
source: A server error occurred. Please try again later.
ar: حدث خطأ في الخادم. يرجى المحاولة لاحقًا.

# error_message_network
source: Please check your internet connection and try again.
ar: يرجى التحقق من اتصال الإنترنت والمحاولة مجددًا.

# error_message_invalid_response_format
source: Received an unexpected response from the server.
ar: تم استلام استجابة غير متوقعة من الخادم.

# error_message_unknown
source: An unknown error occurred. Please try again.
ar: حدث خطأ غير معروف. يرجى المحاولة مرة أخرى.
